IDENTIFICATION DIVISION.
PROGRAM-ID. ACCOUNT-STATUS.
AUTHOR. AATIF.
      
DATA DIVISION.
WORKING-STORAGE SECTION.
01 STATUS        PIC X.
   88 ACTIVE     VALUE 'A'.
   88 INACTIVE   VALUE 'I'.

PROCEDURE DIVISION.
    DISPLAY "ENTER STATUS (A/I): ".
    ACCEPT STATUS.

    IF ACTIVE
        DISPLAY "Account Active"
    ELSE
        DISPLAY "Account Inactive"
    END-IF.

    STOP RUN.
