IDENTIFICATION DIVISION.
PROGRAM-ID. CELTOFACT.
AUTHOR. AATIF.

DATA DIVISION.
 WORKING-STORAGE SECTION.

01 CEL  PIC 9(3)V9(3).
01 FAR   PIC 9(3)V9(3).
01 TEMP  PIC 9(4)V9(3).
PROCEDURE DIVISION.

DISPLAY "FARHN".
ACCEPT CEL.

COMPUTE TEMP = CEL * 9/5.
COMPUTE  FAR = TEMP + 32.

DISPLAY FAR.

STOP RUN.
