IDENTIFICATION DIVISION.
PROGRAM-ID. COMPOUND-INTEREST-CAL.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 P        PIC 9(7)V9(2).   
01 R        PIC 9(3)V9(2).   
01 T        PIC 9(3).        
01 AMOUNT   PIC 9(9)V9(2).
01 CI       PIC 9(9)V9(2).
01 I        PIC 9(3).
01 FACTOR   PIC 9(5)V9(5) VALUE 1.

PROCEDURE DIVISION.
ACCEPT P.
    DISPLAY "ENTER PRINCIPAL:" P.
    
ACCEPT R.
    DISPLAY "ENTER RATE:" R.
   
      ACCEPT T.
    DISPLAY "ENTER TIME (YEARS):" T.
   

    MOVE 1 TO FACTOR.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > T
        COMPUTE FACTOR = FACTOR * (1 + R / 100)
    END-PERFORM

    COMPUTE AMOUNT = P * FACTOR.
    COMPUTE CI = AMOUNT - P.

    DISPLAY "COMPOUND INTEREST = " CI.
    STOP RUN.
