IDENTIFICATION DIVISION.
PROGRAM-ID. CONCAT-2-STRING.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S1 PIC X(20).
01 S2 PIC X(20).
01 S3 PIC X(40).

PROCEDURE DIVISION.
    ACCEPT S1
    ACCEPT S2
    STRING S1 DELIMITED BY SPACE
           S2 DELIMITED BY SPACE
           INTO S3
    END-STRING
    DISPLAY S3
    DISPLAY FUNCTION LENGTH(S3)
    STOP RUN.
