IDENTIFICATION DIVISION.
  PROGRAM-ID. FACTORIAL.
  AUTHOR. AATIF.
  
ENVIRONMENT DIVISION.
  CONFIGURATION SECTION.
  SOURCE-COMPUTER. IBM-3278.
  OBJECT-COMPUTER. IBM-3278.
  
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 NUM        PIC 9(3).
   01 I          PIC 9(3).
   01 FACT       PIC 9(10) VALUE 1.
   
PROCEDURE DIVISION.
  DISPLAY "ENTER A NUMBER: " Num.
  ACCEPT NUM.
DISPLAY "ENTER A NUMBER: " Num.
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
  COMPUTE FACT = FACT * I
  END-PERFORM.
  
  DISPLAY "FACTORIAL IS: " FACT.

STOP RUN.
