IDENTIFICATION DIVISION.
PROGRAM-ID. GRADE-MARK.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MARK PIC 9(3).

PROCEDURE DIVISION.
    ACCEPT MARK

    IF MARK >= 90
        DISPLAY "A"
    ELSE IF MARK >= 80
        DISPLAY "B"
    ELSE IF MARK >= 70
        DISPLAY "C"
    ELSE IF MARK >= 60	
        DISPLAY "D"
    ELSE
        DISPLAY "F"
    END-IF
    STOP RUN.
