IDENTIFICATION DIVISION.
PROGRAM-ID. LARGEST-3.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(3).
01 B PIC 9(3).
01 C PIC 9(3).

PROCEDURE DIVISION.
    ACCEPT A
    ACCEPT B
    ACCEPT C

    IF A > B AND A > C
        DISPLAY A
    ELSE IF B > C
        DISPLAY B
    ELSE
        DISPLAY C
    END-IF
    STOP RUN.