IDENTIFICATION DIVISION.
PROGRAM-ID. MIN-BALANCE.
AUTHOR. AATIF.
      
DATA DIVISION.
WORKING-STORAGE SECTION.
01 BALANCE        PIC Z(5)9.
01 MIN-BAL        PIC 9(4) VALUE 1000.

PROCEDURE DIVISION.
    DISPLAY "ENTER ACCOUNT BALANCE: " .
    ACCEPT BALANCE.

    IF BALANCE >= MIN-BAL
        DISPLAY "Minimum balance maintained"
    ELSE
        DISPLAY "Minimum balance not maintained"
    END-IF.

    STOP RUN.
