
IDENTIFICATION DIVISION.
PROGRAM-ID. PALINDROM.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM  PIC 9(5).
01 TEMP PIC 9(5).
01 REV  PIC 9(5) VALUE 0.
01 REM  PIC 9.

PROCEDURE DIVISION.
    ACCEPT NUM.
    MOVE NUM TO TEMP.

    PERFORM UNTIL TEMP = 0
        COMPUTE REM = FUNCTION MOD(TEMP, 10)
        COMPUTE REV = REV * 10 + REM
        COMPUTE TEMP = TEMP / 10
    END-PERFORM

    IF REV = NUM
        DISPLAY "PALINDROME"
    ELSE
        DISPLAY "NOT PALINDROME"
    END-IF
    STOP RUN.

