IDENTIFICATION DIVISION.
PROGRAM-ID. PRIME-SIMPLE-200.
AUTHOR. AATIF

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM      PIC 9(3).
01 I        PIC 9(3).
01 FLAG     PIC 9.

PROCEDURE DIVISION.
    PERFORM VARYING NUM FROM 2 BY 1 UNTIL NUM > 200
        MOVE 1 TO FLAG

        PERFORM VARYING I FROM 2 BY 1 UNTIL I * I > NUM
            IF FUNCTION MOD(NUM, I) = 0
                MOVE 0 TO FLAG
                EXIT PERFORM
            END-IF
        END-PERFORM

        IF FLAG = 1
            DISPLAY NUM
        END-IF
    END-PERFORM

    STOP RUN.
