IDENTIFICATION DIVISION.
PROGRAM-ID. REVERSE-NUM-5.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM   PIC 9(5).
01 REV   PIC 9(5) VALUE 0.
01 REM   PIC 9.
01 TEMP  PIC 9(5).

PROCEDURE DIVISION.
 ACCEPT Num.
    DISPLAY "ENTER 5 DIGIT NUMBER:" NUM.
    

    MOVE NUM TO TEMP.

    PERFORM 5 TIMES
        COMPUTE REM = FUNCTION MOD(TEMP, 10)
        COMPUTE REV = (REV * 10) + REM
        COMPUTE TEMP = TEMP / 10
    END-PERFORM

    DISPLAY "REVERSED NUMBER = " REV.
    STOP RUN.
