IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE-INTEREST-CAL.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 P   PIC 9(7)V9(2).   
01 R   PIC 9(3)V9(2).   
01 T   PIC 9(3)V9(2).   
01 SI  PIC 9(9)V9(2).   

PROCEDURE DIVISION.
    ACCEPT P.
    DISPLAY "ENTER PRINCIPAL:" p.
    
    ACCEPT R.
    DISPLAY "ENTER RATE:" R.
    
     ACCEPT T.
    DISPLAY "ENTER TIME:" T.
    

    COMPUTE SI = (P * R * T) / 100.

    DISPLAY "SIMPLE INTEREST = " SI.
    STOP RUN.

