
IDENTIFICATION DIVISION.
PROGRAM-ID. SUM20.
AUTHOR. AATIF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARR.
   05 A PIC 9(3) OCCURS 20 TIMES.
01 I   PIC 9(2).
01 SUM PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 20
        ACCEPT A(I)
        ADD A(I) TO SUM
    END-PERFORM
    DISPLAY "SUM = " SUM
    STOP RUN.

