IDENTIFICATION DIVISION.
PROGRAM-ID. WITHDRAWAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BALANCE     PIC 9(6).
01 WITHDRAW    PIC 9(6).

PROCEDURE DIVISION.
    DISPLAY "ENTER BALANCE: ".
    ACCEPT BALANCE.
    DISPLAY "ENTER WITHDRAW AMOUNT: ".
    ACCEPT WITHDRAW.

    IF WITHDRAW <= BALANCE
        SUBTRACT WITHDRAW FROM BALANCE
        DISPLAY "Withdrawal Successful"
        DISPLAY "BALANCE: " BALANCE
    ELSE
        DISPLAY "Insufficient Balance"
    END-IF.

    STOP RUN.
